<!DOCTYPE html>
<html lang="en">

<head>
    <title>Dissecting a Barebones WDM Driver – Notebook</title>

        <meta charset="utf-8" />
    <meta content='text/html; charset=utf-8' http-equiv='Content-Type'>
    <meta http-equiv='X-UA-Compatible' content='IE=edge'>
    <meta name='viewport' content='width=device-width, initial-scale=1.0, maximum-scale=1.0'>

    <meta name="twitter:card" content="summary">
    <meta name="twitter:creator" content="@mattbierner">
    <meta name="author" content="Josh Finley" />


    <meta property="og:title" content="Dissecting a Barebones WDM Driver" />
    <meta property="twitter:title" content="Dissecting a Barebones WDM Driver" />



    <meta name="description" content="Chapter 4 of Kernel Programming for Windows walks through the process of developing a driver “from start to finish”. This post is for quick notes on the dissection of this example driver, taken for learning purposes.

" />
    <meta property="og:description" content="Chapter 4 of Kernel Programming for Windows walks through the process of developing a driver “from start to finish”. This post is for quick notes on the dissection of this example driver, taken for learning purposes.

" />
    <meta name="twitter:description" content="Chapter 4 of Kernel Programming for Windows walks through the process of developing a driver “from start to finish”. This post is for quick notes on the dissection of this example driver, taken for learning purposes.

">



    

<p><code class="language-plaintext highlighter-rouge">DriverObject</code> is defined in <code class="language-plaintext highlighter-rouge">wdm.h</code> as follows:</p>

<div class="language-c++ highlighter-rouge"><div class="highlight"><pre class="highlight"><code><span class="k">typedef</span> <span class="k">struct</span> <span class="nc">_DRIVER_OBJECT</span> <span class="p">{</span>
  <span class="n">CSHORT</span>             <span class="n">Type</span><span class="p">;</span>
  <span class="n">CSHORT</span>             <span class="n">Size</span><span class="p">;</span>
  <span class="n">PDEVICE_OBJECT</span>     <span class="n">DeviceObject</span><span class="p">;</span>          <span class="c1">// pointer to device objects created by the driver</span>
  <span class="n">ULONG</span>              <span class="n">Flags</span><span class="p">;</span>                 
  <span class="n">PVOID</span>              <span class="n">DriverStart</span><span class="p">;</span>           
  <span class="n">ULONG</span>              <span class="n">DriverSize</span><span class="p">;</span>            
  <span class="n">PVOID</span>              <span class="n">DriverSection</span><span class="p">;</span>         
  <span class="n">PDRIVER_EXTENSION</span>  <span class="n">DriverExtension</span><span class="p">;</span>       <span class="c1">// pointer to driver extension</span>
  <span class="n">UNICODE_STRING</span>     <span class="n">DriverName</span><span class="p">;</span>             
  <span class="n">PUNICODE_STRING</span>    <span class="n">HardwareDatabase</span><span class="p">;</span>      <span class="c1">// pointer to the \Registry\Machine\Hardware path to the configuration information in the registry</span>
  <span class="n">PFAST_IO_DISPATCH</span>  <span class="n">FastIoDispatch</span><span class="p">;</span>        
  <span class="n">PDRIVER_INITIALIZE</span> <span class="n">DriverInit</span><span class="p">;</span>            <span class="c1">// entry point for DriverEntry, setup by I/O manager</span>
  <span class="n">PDRIVER_STARTIO</span>    <span class="n">DriverStartIo</span><span class="p">;</span>         
  <span class="n">PDRIVER_UNLOAD</span>     <span class="n">DriverUnload</span><span class="p">;</span>          <span class="c1">// entry point for DriverUnload set by DriverEntry</span>
  <span class="n">PDRIVER_DISPATCH</span>   <span class="n">MajorFunction</span><span class="p">[</span><span class="n">IRP_MJ_MAXIMUM_FUNCTION</span> <span class="o">+</span> <span class="mi">1</span><span class="p">];</span>    <span class="c1">// dispatch table consisting of an array of entry points for the drivers DispatchXxx routines</span>
<span class="p">}</span> <span class="n">DRIVER_OBJECT</span><span class="p">,</span> <span class="o">*</span><span class="n">PDRIVER_OBJECT</span><span class="p">;</span>
</code></pre></div></div>

<p>Examination of some of these types:</p>

<div class="language-plaintext highlighter-rouge"><div class="highlight"><pre class="highlight"><code>2: kd&gt; dt _DRIVER_OBJECT
PriorityBooser!_DRIVER_OBJECT
   +0x000 Type             : Int2B
   +0x002 Size             : Int2B
   +0x008 DeviceObject     : Ptr64 _DEVICE_OBJECT
   +0x010 Flags            : Uint4B
   +0x018 DriverStart      : Ptr64 Void
   +0x020 DriverSize       : Uint4B
   +0x028 DriverSection    : Ptr64 Void
   +0x030 DriverExtension  : Ptr64 _DRIVER_EXTENSION
   +0x038 DriverName       : _UNICODE_STRING
   +0x048 HardwareDatabase : Ptr64 _UNICODE_STRING
   +0x050 FastIoDispatch   : Ptr64 _FAST_IO_DISPATCH
   +0x058 DriverInit       : Ptr64     long 
   +0x060 DriverStartIo    : Ptr64     void 
   +0x068 DriverUnload     : Ptr64     void 
   +0x070 MajorFunction    : [28] Ptr64     long 
</code></pre></div></div>

<div class="language-plaintext highlighter-rouge"><div class="highlight"><pre class="highlight"><code>2: kd&gt; dt PDEVICE_OBJECT
PriorityBooster!PDEVICE_OBJECT
Ptr64    +0x000 Type             : Int2B
   +0x002 Size             : Uint2B
   +0x004 ReferenceCount   : Int4B
   +0x008 DriverObject     : Ptr64 _DRIVER_OBJECT
   +0x010 NextDevice       : Ptr64 _DEVICE_OBJECT
   +0x018 AttachedDevice   : Ptr64 _DEVICE_OBJECT
   +0x020 CurrentIrp       : Ptr64 _IRP
   +0x028 Timer            : Ptr64 _IO_TIMER
   +0x030 Flags            : Uint4B
   +0x034 Characteristics  : Uint4B
   +0x038 Vpb              : Ptr64 _VPB
   +0x040 DeviceExtension  : Ptr64 Void
   +0x048 DeviceType       : Uint4B
   +0x04c StackSize        : Char
   +0x050 Queue            : &lt;anonymous-tag&gt;
   +0x098 AlignmentRequirement : Uint4B
   +0x0a0 DeviceQueue      : _KDEVICE_QUEUE
   +0x0c8 Dpc              : _KDPC
   +0x108 ActiveThreadCount : Uint4B
   +0x110 SecurityDescriptor : Ptr64 Void
   +0x118 DeviceLock       : _KEVENT
   +0x130 SectorSize       : Uint2B
   +0x132 Spare1           : Uint2B
   +0x138 DeviceObjectExtension : Ptr64 _DEVOBJ_EXTENSION
   +0x140 Reserved         : Ptr64 Void

2: kd&gt; dt PDRIVER_EXTENSION
PriorityBooster!PDRIVER_EXTENSION
Ptr64    +0x000 DriverObject     : Ptr64 _DRIVER_OBJECT
   +0x008 AddDevice        : Ptr64     long 
   +0x010 Count            : Uint4B
   +0x018 ServiceKeyName   : _UNICODE_STRING

2: kd&gt; dt PFAST_IO_DISPATCH
PriorityBooster!PFAST_IO_DISPATCH
Ptr64    +0x000 SizeOfFastIoDispatch : Uint4B
   +0x008 FastIoCheckIfPossible : Ptr64     unsigned char 
   +0x010 FastIoRead       : Ptr64     unsigned char 
   +0x018 FastIoWrite      : Ptr64     unsigned char 
   +0x020 FastIoQueryBasicInfo : Ptr64     unsigned char 
   +0x028 FastIoQueryStandardInfo : Ptr64     unsigned char 
   +0x030 FastIoLock       : Ptr64     unsigned char 
   +0x038 FastIoUnlockSingle : Ptr64     unsigned char 
   +0x040 FastIoUnlockAll  : Ptr64     unsigned char 
   +0x048 FastIoUnlockAllByKey : Ptr64     unsigned char 
   +0x050 FastIoDeviceControl : Ptr64     unsigned char 
   +0x058 AcquireFileForNtCreateSection : Ptr64     void 
   +0x060 ReleaseFileForNtCreateSection : Ptr64     void 
   +0x068 FastIoDetachDevice : Ptr64     void 
   +0x070 FastIoQueryNetworkOpenInfo : Ptr64     unsigned char 
   +0x078 AcquireForModWrite : Ptr64     long 
   +0x080 MdlRead          : Ptr64     unsigned char 
   +0x088 MdlReadComplete  : Ptr64     unsigned char 
   +0x090 PrepareMdlWrite  : Ptr64     unsigned char 
   +0x098 MdlWriteComplete : Ptr64     unsigned char 
   +0x0a0 FastIoReadCompressed : Ptr64     unsigned char 
   +0x0a8 FastIoWriteCompressed : Ptr64     unsigned char 
   +0x0b0 MdlReadCompleteCompressed : Ptr64     unsigned char 
   +0x0b8 MdlWriteCompleteCompressed : Ptr64     unsigned char 
   +0x0c0 FastIoQueryOpen  : Ptr64     unsigned char 
   +0x0c8 ReleaseForModWrite : Ptr64     long 
   +0x0d0 AcquireForCcFlush : Ptr64     long 
   +0x0d8 ReleaseForCcFlush : Ptr64     long 

2: kd&gt; dt PDRIVER_INITIALIZE
PriorityBooster!PDRIVER_INITIALIZE
Ptr64  long (
	_DRIVER_OBJECT*, 
	_UNICODE_STRING*)

2: kd&gt; dt PDRIVER_STARTIO
PriorityBooster!PDRIVER_STARTIO
Ptr64  void (
	_DEVICE_OBJECT*, 
	_IRP*)

2: kd&gt; dt PDRIVER_UNLOAD
PriorityBooster!PDRIVER_UNLOAD
Ptr64  void (
	_DRIVER_OBJECT*)

2: kd&gt; dt PDRIVER_DISPATCH
PriorityBooster!PDRIVER_DISPATCH
Ptr64  long (
	_DEVICE_OBJECT*, 
	_IRP*)
</code></pre></div></div>

<p>The most relevant structures of these to the study at hand are:</p>
<ul>
  <li><code class="language-plaintext highlighter-rouge">PDEVICE_OBJECT DeviceObject</code></li>
  <li><code class="language-plaintext highlighter-rouge">PDRIVER_DISPATCH MajorFunction</code></li>
</ul>

<p>First, lets look at <code class="language-plaintext highlighter-rouge">PDRIVER_DISPATCH MajorFunction</code>:</p>
